app/views/orders/index.html.erb

          <td>
            <!-- <input type="number" value="{{orders[orders.length - 1].id + 1 }}" ng-model="newOrder.id" disabled> -->
---
SELECT "orders".* FROM "orders"