app/controllers/comments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 14]]
INSERT INTO "comments" ("body", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Super fun"], ["product_id", 14], ["user_id", 1], ["created_at", "2015-10-15 17:31:08.799964"], ["updated_at", "2015-10-15 17:31:08.799964"]]
---
  def create
    @product = Product.find(params[:product_id])
    @comment = @product.comments.new(comment_params)
    @comment.user = current_user
    respond_to do |format|
      if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
  def destroy
    @comment = Comment.find(params[:id])
    product = @comment.product
    @comment.destroy