app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
    def index
      @orders = Order.all.to_json(:include => [{:product => {:only => :name}}, {:user => {:only => :email}}])

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 16]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 14]]
---
    def show
      @order = Order.find(params[:id]).to_json(:include => [{:product => {:only => :name}}, {:user => {:only => :email}}])

INSERT INTO "orders" ("product_id", "total") VALUES (?, ?)  [["product_id", 14], ["total", 0.02]]
---
    def create
      @order = Order.create(order_params)

DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 4]]
---
    def destroy
      respond_with Order.destroy(params[:id])