app/controllers/payments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 15]]
INSERT INTO "orders" ("total", "product_id", "user_id") VALUES (?, ?, ?)  [["total", 100.0], ["product_id", 15], ["user_id", 1]]
---
  def create
  token = params[:stripeToken]
  @product = Product.find(params[:product_id])
  # Create the charge on Stripe's servers - this will charge the user's card
  begin
    charge = Stripe::Charge.create(
      :amount => @product.price,
      :currency => "usd",
      :source => token,
      :description => @product.description
    )

    if charge.paid
      Order.create(
        :total => @product.price,
        :product_id => @product.id,
        :user_id => @user.id
      )