app/controllers/products_controller.rb

  def index
  if params[:q]
    search_term = params[:q]
    @products = Product.where("LOWER(name) LIKE ? OR LOWER(description) LIKE ?", "%#{search_term.downcase}%", "%#{search_term.downcase}%")
  else
    @products = Product.all
---
SELECT "products".* FROM "products" WHERE (LOWER(name) LIKE '%antique%' OR LOWER(description) LIKE '%antique%')
SELECT "products".* FROM "products"

  def show
    @comments = @product.comments.order("created_at DESC").paginate(:page => params[:page], :per_page => 1)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ?  ORDER BY created_at DESC LIMIT 5 OFFSET 0  [["product_id", 15]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 15]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image_url", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Awesome bike"], ["description", "awesome!"], ["image_url", ""], ["color", "blue"], ["created_at", "2015-09-23 16:43:17.431897"], ["updated_at", "2015-09-23 16:43:17.431897"]]