app/controllers/static_pages_controller.rb

  def landing_page
    @featured_product = Product.all
    @products = Product.limit(3)
---
SELECT  "products".* FROM "products"  ORDER BY "products"."id" ASC LIMIT 1 OFFSET 1
SELECT  "products".* FROM "products" LIMIT 3